{
	"resourceType": "StructureDefinition",
	"id": "documenttype-nationalStandard",
	"url": "http://va.gov/fhir/us/vha-ampl-ig/StructureDefinition/documenttype-nationalStandard",
	"name": "documenttype-nationalStandard",
	"status": "draft",
	"date": "2021-05-01T07:59:44.528Z",
	"description": "Some Document Definitions, for example, CWAD's, are developed nationally and sent out as standardized entries across the nation.  TIU and other packages depend on their standard definition, and they must not be edited by sites but only by the persons who are nationally responsible for them.   Such entries are marked NATIONAL STANDARD (field has value 1 for YES), which generally prevents sites from editing the entry.   In two cases, sites are permitted to edit National Standard entries.  The first case concerns Titles.  Sites can edit Status and Abbreviation for National Titles.  Status INACTIVE for a National Title prevents manual and upload entry of documents for the Title, while continuing to permit automatic entry for the Title via the TIU application interface for new notes. (Example: Adverse Reaction/Allergy notes are automatically entered by the Allergy package.) Editing Abbreviation gives sites a means of grouping national titles with other National and non-National Titles as they please.   The second case where edit of National entries is permitted concerns the Item Multiple:   If a National Standard entry has Type Class or Document Class, sites can add/delete Nonnational items as they please, and can edit ALL items AS ITEMS (e.g. Item Sequence, etc.).  Sites CANNOT add/delete National items.   If a National Standard entry has Type Title or Component, sites cannot add or delete items, but can still edit items AS ITEMS.   Sites cannot add National Standard entries as Items to parents.  There is one exception: Sites can add National Shared Components to (nonnational) Titles if they wish.  Sites can delete National Standard Items from nonnational parents. (Unless there has been a mistake, such items will be limited to Shared Components only.)   Field is NOT heritable.  If field has no value for an entry, value is 0 by default.  This means that entries created by sites are NOT National Standard.   Technical Note:   National entries (except for Shared Components) must have National ancestors:  if a National entry has a nonNational ancestor, the Document Definition Utility TIUF does not permit it to be activated. (Shared Components need not have National ancestors, and do not have a Status.)   National Standard is a BASIC field.",
	"fhirVersion": "3.0.2",
	"mapping": [
		{
			"identity": "vista",
			"uri": "http://va.gov/vista/",
			"name": "VistA"
		}
	],
	"kind": "resource",
	"abstract": false,
	"contextType": "resource",
	"context": [
		"DocumentReference"
	],
	"type": "Extension",
	"baseDefinition": "http://hl7.org/fhir/StructureDefinition/Extension",
	"derivation": "constraint",
	"differential": {
		"element": [
			{
				"id": "Extension.url",
				"path": "Extension.url",
				"fixedUri": "http://va.gov/fhir/us/vha-ampl-ig/StructureDefinition/documenttype-nationalStandard"
			},
			{
				"id": "Extension.valueString",
				"path": "Extension.valueString",
				"type": [
					{
						"code": "string"
					}
				],
				"mapping": [
					{
						"identity": "vista",
						"map": "TIU DOCUMENT DEFINITION FILE @NATIONAL STANDARD 8925.1-.13"
					}
				]
			}
		]
	}
}